modules/Taurus/bzt/Learning-trainingCampaign.yaml
execution:
- concurrency: 20
  ramp-up: 120s
  hold-for: 5m
  scenario: Learning

- concurrency: 20
  ramp-up: 120s
  hold-for: 5m
  scenario: Training Campaign

scenarios:
  Learning:
    requests:
    - follow-redirects: true
      headers:
        X-Application-Id: a6fc214d0ff04e86b0d3da67f5d09cc3
        X-Customer-Id: 2fe4c2
        accept: application/json
      label: HTTP Request
      method: GET
      url: https://outthink-api-dev.azure-api.net/learning/organizations/1e3c3d6a-fc16-4d5f-b5f2-9eb8164e1fca/hierarchy
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: false

  Training Campaign:
    requests:
    - follow-redirects: true
      headers:
        X-Application-Id: a6fc214d0ff04e86b0d3da67f5d09cc3
        X-Customer-Id: 2fe4c2
        accept: application/json
      label: HTTP Request
      method: GET
      url: https://outthink-api-dev.azure-api.net/learning/training-campaigns
    store-cache: false
    store-cookie: false
    use-dns-cache-mgr: false